spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_reference_id.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_2RrwuZy3Kn0Mou
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.4
      Authorization:
      - Bearer sk_test_Hwt3lKIQQIQ7Q4fVwbcJOntX
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.4","lang":"ruby","lang_version":"1.9.3 p392 (2013-02-22)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        Gateki-MacBook-Air.local 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1 17:57:12
        PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Aug 2013 02:58:03 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1561'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"evt_2RrwuZy3Kn0Mou\",\n  \"created\": 1377416660,\n
        \ \"livemode\": false,\n  \"type\": \"charge.succeeded\",\n  \"data\": {\n
        \   \"object\": {\n      \"id\": \"ch_2RrvNfL3mCgzEN\",\n      \"object\":
        \"charge\",\n      \"created\": 1377416659,\n      \"livemode\": false,\n
        \     \"paid\": true,\n      \"amount\": 999,\n      \"currency\": \"usd\",\n
        \     \"refunded\": false,\n      \"card\": {\n        \"id\": \"card_2Rrvf3fFLALvgn\",\n
        \       \"object\": \"card\",\n        \"last4\": \"4242\",\n        \"type\":
        \"Visa\",\n        \"exp_month\": 8,\n        \"exp_year\": 2015,\n        \"fingerprint\":
        \"MDPDqQ5D8jnzbtjS\",\n        \"customer\": \"cus_2RrvJ2GLt9gcOI\",\n        \"country\":
        \"US\",\n        \"name\": null,\n        \"address_line1\": null,\n        \"address_line2\":
        null,\n        \"address_city\": null,\n        \"address_state\": null,\n
        \       \"address_zip\": null,\n        \"address_country\": null,\n        \"cvc_check\":
        \"pass\",\n        \"address_line1_check\": null,\n        \"address_zip_check\":
        null\n      },\n      \"captured\": true,\n      \"balance_transaction\":
        \"txn_2RrwYJMe4FFBXk\",\n      \"failure_message\": null,\n      \"failure_code\":
        null,\n      \"amount_refunded\": 0,\n      \"customer\": \"cus_2RrvJ2GLt9gcOI\",\n
        \     \"invoice\": \"in_2RrvchYABpSCpE\",\n      \"description\": null,\n
        \     \"dispute\": null,\n      \"fee\": 59,\n      \"fee_details\": [\n        {\n
        \         \"amount\": 59,\n          \"currency\": \"usd\",\n          \"type\":
        \"stripe_fee\",\n          \"description\": \"Stripe processing fees\",\n
        \         \"application\": null\n        }\n      ]\n    }\n  },\n  \"object\":
        \"event\",\n  \"pending_webhooks\": 0,\n  \"request\": \"iar_2RrvekIgldL64F\"\n}\n"
    http_version: 
  recorded_at: Mon, 26 Aug 2013 02:58:04 GMT
recorded_with: VCR 2.5.0
